Долома/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <registerRecords>AccumulationRegister.РасчетыПоДоговорам</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКлиентами</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасхода</name>
    <type>
      <types>CatalogRef.СтатьиРасхода</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/Documents/ПоступлениеТоваровУслуг/ManagerModule.bsl
Функция ПолучитьПоляЗаполнения() Экспорт
	
	МассивПолейЗаполнения = Новый Массив;
	
	//НОМЕНКЛАТУРА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"НоменклатураУслуга");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОбщаяТаблица");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Номенклатура/Услуга");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Номенклатура"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//КОЛИЧЕСТВО
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Количество");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОбщаяТаблица");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Количество");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ЦЕНА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Цена");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОбщаяТаблица");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Цена");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	Возврат МассивПолейЗаполнения;
	
КонецФункции
